export const NOT_VALID_EMAIL = 'Неверный формат адреса электронной почты';
export const EMAIL_NOT_STRING =
  'Адрес электронной почты должен быть предствлен в виде строки';
export const USERNAME_MIN_LENGTH =
  'Имя пользователя должно должно содержать как минимум 5 символов';
export const USERNAME_NOT_STRING =
  'Имя пользователя должно быть предствлено в виде строки';
export const NOT_VALID_PASSWORD = `Пароль должен содержать от 8 до 20 символов, хотя бы один символ в верхнем регистре, хотя бы один в нижнем регистре, одну цифру и один специальный символ`;
export const PASSWORD_NOT_STRING =
  'Пароль должен быть предствлен в виде строки';
